Revit 2026 API

# XYZCrossProduct Method

---

The cross product of this vector and the specified vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ CrossProduct(
	XYZ source
)
```
```vb
Public Function CrossProduct (
	source As XYZ
) As XYZ
```
```cpp
public:
XYZ^ CrossProduct(
	XYZ^ source
)
```
```fsharp
member CrossProduct :
        source : XYZ -> XYZ
```

#### Parameters

source XYZ
    The vector to multiply with this vector.

#### Return Value

XYZThe vector equal to the cross product.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when source is . |

The cross product is defined as the vector which is perpendicular to both vectors with a magnitude equal to the area of the parallelogram they span. Also known as vector product or outer product.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace